[
{
      "id": "tempchange_to_report",
      "zwave": {
        "index": 1,
        "size": 1
      },
	  "attr": {
      "min": 0,
      "max": 100
    },
      "type": "number",
      "value": 20,
      "label": {
        "en": "Minimum Temperature change to report",
        "nl": "Minimale temperatuursverandering te melden",
		"de": "Minimale Temperaturänderung für den Bericht"
      },
      "hint": {
        "en": "This value defines the minimum change of temperature to cause an unsolicited report of humidity to the central controller using Lifeline. If the value is set to 0, there will be no reports sent to the controller, when the temperature changes. However, periodic reports, managed by configuration parameter 4, may still be active. (0-100, 1/10 degree)",
        "nl": "Deze waarde definieert de minimale temperatuursverandering die een ongevraagde melding van de luchtvochtigheid aan de centrale met behulp van Lifeline veroorzaakt. Als de waarde op 0 is ingesteld, worden er geen meldingen naar de regelaar gestuurd wanneer de temperatuur verandert. Periodieke rapporten, beheerd door configuratieparameter 4, kunnen echter nog steeds actief zijn. (0-100, 1/10 graad)",
		"de": "Dieser Wert definiert die minimale Temperaturänderung, um eine unaufgeforderte Meldung der Luftfeuchtigkeit an die zentrale Steuerung über die Lifeline zu veranlassen.Wenn der Wert auf 0 gesetzt ist, werden keine Meldungen an die Steuerung gesendet, wenn sich die Temperatur ändert. Periodische Berichte, die über den Konfigurationsparameter 4 verwaltet werden, können jedoch weiterhin aktiv sein. (0-100, 0.1° Schritte)"
      }
    },
	{
      "id": "humiditychange_to_report",
      "zwave": {
        "index": 2,
        "size": 1
      },
	  "attr": {
      "min": 0,
      "max": 100
    },
      "type": "number",
      "value": 7,
      "label": {
        "en": "Minimum humidity change to report",
        "nl": "Minimale vochtigheidsverandering te melden",
		"de": "Minimale Feuchtigkeitsänderung für den Bericht"
      },
      "hint": {
        "en": "This parameter defines the time interval to send an unsolicited report. If the value is set to 0, there will be no periodic reports sent to the controller. However, reports on temperature/humidity changes, managed by configuration parameters 1 and 2, may still be active. (0-100, %)",
        "nl": "Deze parameter definieert het tijdsinterval voor het verzenden van een ongevraagde melding. Als de waarde op 0 is ingesteld, worden er geen periodieke rapporten naar de regelaar gestuurd. Het is echter mogelijk dat er nog steeds rapporten over temperatuur- en vochtigheidsveranderingen, beheerd door de configuratieparameters 1 en 2, actief zijn. (0-100, %)",
		"de": "Dieser Wert definiert die minimale Änderung der Luftfeuchtigkeit, um eine unaufgeforderte Meldung der Luftfeuchtigkeit an die zentrale Steuerung über Lifeline zu veranlassen.Wenn der Wert auf 0 gesetzt ist, werden keine Meldungen an die Steuerung gesendet, wenn sich die Luftfeuchtigkeit ändert. Periodische Berichte, die über den Konfigurationsparameter 4 verwaltet werden, können jedoch weiterhin aktiv sein.  (0-100, in %)"
      }
    },
		{
      "id": "periodic_report",
      "zwave": {
        "index": 4,
        "size": 2,
		"signed": false
      },
	  "attr": {
      "min": 0,
      "max": 65535
    },
      "type": "number",
      "value": 43200,
      "label": {
        "en": "Periodic Reports",
        "nl": "Periodieke rapporten",
		"de": "Periodische Berichte"
      },
      "hint": {
        "en": "This parameter defines the time interval to send an unsolicited report. If the value is set to 0, there will be no periodic reports sent to the controller. However, reports on temperature/humidity changes, managed by configuration parameters 1 and 2, may still be active. (0, 900-65535)",
        "nl": "Deze parameter definieert het tijdsinterval voor het verzenden van een ongevraagde melding. Als de waarde op 0 is ingesteld, worden er geen periodieke rapporten naar de regelaar gestuurd. Het is echter mogelijk dat er nog steeds rapporten over temperatuur- en vochtigheidsveranderingen, beheerd door de configuratieparameters 1 en 2, actief zijn.  (0, 900-65535)",
		"de": "Dieser Parameter definiert das Zeitintervall für das Senden eines unaufgeforderten Berichts.Wenn der Wert auf 0 gesetzt ist, werden keine regelmäßigen Berichte an die Steuerung gesendet. Es ist jedoch möglich, dass Berichte über Temperatur-/Feuchteänderungen, die über die Konfigurationsparameter 1 und 2 verwaltet werden, noch aktiv sind. (0, 900-65535)"
      }
    },
	{
      "id": "temperature_report_upper",
      "zwave": {
        "index": 5,
        "size": 2,
		"signed": false
      },
	  "attr": {
      "min": 0,
      "max": 1000
    },
      "type": "number",
      "value": 0,
      "label": {
        "en": "Temperature Upper Watermark value",
        "nl": "Temperatuur Bovenste watermerk waarde",
		"de": "Oberer Temperaturschwellwert"
      },
      "hint": {
        "en": "This parameter defines a temperature. If the measured temperature surpasses this watermark a BASIC command is sent into Association Group 2  (0-1000, 1/10 degree)",
        "nl": "Deze parameter definieert een temperatuur. Als de gemeten temperatuur dit watermerk overschrijdt, wordt een BASIC-commando naar Associatiegroep 2 gestuurd (0-1000, 1/10 graad).",
		"de": "Dieser Parameter definiert eine Temperatur. Überschreitet die gemessene Temperatur diesen Schwellwert, wird ein BASIC-Befehl an die Verknüpfungsgruppe 2 gesendet (0-1000, 0.1° Schritte)"
      }
    },
		{
      "id": "temperature_report_lower",
      "zwave": {
        "index": 6,
        "size": 2,
		"signed": false
      },
	  "attr": {
      "min": 0,
      "max": 65535
    },
      "type": "number",
      "value": 0,
      "label": {
        "en": "Temperature Lower Watermark value",
        "nl": "Temperatuur Lagere watermerkwaarde",
		"de": "Unterer Temperaturschwellwert"
      },
      "hint": {
        "en": "This parameter defines a temperature. If the measured temperature dropps below this watermark a BASIC command is sent into Association Group 3. (1 - 1000: 1/10 degree [0,1°C - 100°C]. 65336 - 65535: 1/10 degree [-20,0°C - -0,1°C])",
        "nl": "Deze parameter definieert een temperatuur. Als de gemeten temperatuur onder dit watermerk daalt, wordt een BASIC-commando naar Associatiegroep 3 gestuurd. (1 - 1000: 1/10 graad [0,1°C - 100°C]. 65336 - 65535: 1/10 graad [-20,0°C - -0,1°C])",
		"de": "Dieser Parameter definiert eine Temperatur. Unterschreitet die gemessene Temperatur diesen Schwellwert, wird ein BASIC-Befehl an die  Verknüpfungsgruppe 3 gesendet. (1 - 1000: 0,1°C bis 100,0°C.  65336-65535: -20,0°C bis -0,1°C) "
      }
    },
			{
      "id": "humidtiy_report_upper",
      "zwave": {
        "index": 7,
        "size": 1
      },
	  "attr": {
      "min": 0,
      "max": 100
    },
      "type": "number",
      "value": 0,
      "label": {
        "en": "Humidity Upper Watermark value",
        "nl": "Vochtigheid Bovenste watermerkwaarde",
		"de": "Luftfeuchtigkeit oberer Schwellwert "
      },
      "hint": {
        "en": "This parameter defines a relative humidity. If the measured relative humidity surpasses this watermark a BASIC command is sent into Association Group 4 (0, 10-100 %)",
        "nl": "Deze parameter definieert een relatieve vochtigheid. Als de gemeten relatieve vochtigheid dit watermerk overschrijdt, wordt een BASIC-commando naar Associatiegroep 4 gestuurd (0, 10-100 %)",
		"de": "Dieser Parameter definiert eine relative Luftfeuchtigkeit. Überschreitet die gemessene relative Luftfeuchtigkeit diesen Schwellwert, wird ein BASIC-Befehl an die Verknüpfungsgruppe 4 gesendet. (0, 10-100 in %)"
      }
    },
	{
      "id": "humidtiy_report_lower",
      "zwave": {
        "index": 8,
        "size": 1
      },
	  "attr": {
      "min": 0,
      "max": 90
    },
      "type": "number",
      "value": 0,
      "label": {
        "en": "Humidity Lower Watermark value",
        "nl": "Vochtigheid Lagere watermerkwaarde ",
		"de": "Luftfeuchtigkeit unterer Schwellwert"
      },
      "hint": {
        "en": "This parameter defines a relative humidity. If the measured temperature dropps below this relative humidity a BASIC command is sent into Association Group 5 (0, 1-90 %)",
        "nl": "Deze parameter definieert een relatieve vochtigheid. Als de gemeten temperatuur onder deze relatieve vochtigheid zakt, wordt een BASIC-commando naar Associatiegroep 5 gestuurd.  (0, 1-90 %)",
		"de": "Dieser Parameter definiert eine relative Luftfeuchtigkeit. Fällt die gemessene Luftfeuchtigkeit unter diesen Schwellwert, wird ein BASIC-Befehl an die Verknüpfungsgruppe 5 gesendet.  (0, 1-90 in %)"
      }
    },
		{
      "id": "low_temp_trigger",
      "zwave": {
        "index": 9,
        "size": 1,
		"signed": false
      },
	  "attr": {
      "min": 0,
      "max": 255
    },
      "type": "number",
      "value": 255,
      "label": {
        "en": "Low Temperature Trigger BASIC Set Command Value",
        "nl": "Lage temperatuur Trigger BASIC Ingestelde opdrachtwaarde voor lage temperatuur Trigger ",
		"de": "Basic Werte bei unterer Temperaturschwelle"
      },
      "hint": {
        "en": "This defines what BASIC command shall be sent out into association group 3",
        "nl": "Dit definieert wat het BASIC-commando moet worden verzonden naar groep 3 van de vereniging",
		"de": "Hiermit wird definiert, welcher BASIC-Befehl in die Assoziationsgruppe 3 gesendet werden soll. "
      }
    },
			{
      "id": "high_temp_trigger",
      "zwave": {
        "index": 10,
        "size": 1,
		"signed": false
      },
	  "attr": {
      "min": 0,
      "max": 255
    },
      "type": "number",
      "value": 0,
      "label": {
        "en": "High Temperature Trigger BASIC Set Command Value",
        "nl": "Hoge Temperatuur Trigger BASIC Ingestelde Commandowaarde",
		"de": "Basic Wert bei oberen Temperaturschwellwert"
      },
      "hint": {
        "en": "This defines what BASIC command shall be sent out into association group 2",
        "nl": "Dit definieert wat het BASIC-commando moet worden verzonden naar associaties met groep 2",
		"de": "Hiermit wird definiert, welcher BASIC-Befehl in die Assoziationsgruppe 2 gesendet werden soll. "
      }
    },
				{
      "id": "low_humidity_trigger",
      "zwave": {
        "index": 11,
        "size": 1,
		"signed": false
      },
	  "attr": {
      "min": 0,
      "max": 255
    },
      "type": "number",
      "value": 255,
      "label": {
        "en": "Low Humidity  Trigger BASIC Set Command Value",
        "nl": "Laage Vochtigheid Trigger BASIC Ingestelde Commandowaarde",
		"de": "Basic Wert bei unterem Luftfeuchtigkeitsschwellwert "
      },
      "hint": {
        "en": "This defines what BASIC command shall be sent out into association group 5",
        "nl": "Dit definieert wat het BASIC-commando moet worden verzonden naar associaties met groep 5",
		"de": "Hiermit wird definiert, welcher BASIC-Befehl in die Assoziationsgruppe 5 gesendet werden soll. "
      }
    },
				{
      "id": "high_humidity_trigger",
      "zwave": {
        "index": 12,
        "size": 1,
		"signed": false
      },
	  "attr": {
      "min": 0,
      "max": 255
    },
      "type": "number",
      "value": 0,
      "label": {
        "en": "High Humidity Trigger BASIC Set Command Value",
        "nl": "Hoge Vochtigheid Trigger BASIC Ingestelde Commandowaarde",
		"de": "Basic Wert bei oberen Luftfeuchtigkeitsschwellwert"
      },
      "hint": {
        "en": "This defines what BASIC command shall be sent out into association group 4",
        "nl": "Dit definieert wat het BASIC-commando moet worden verzonden naar associaties met groep 4",
		"de": "Hiermit wird definiert, welcher BASIC-Befehl in die Assoziationsgruppe 4 gesendet werden soll. "
      }
    }
  ]
